const holiday = [
  '1月4日', '1月5日', '1月11日', '1月12日', '1月18日', '1月24日', '1月25日', '1月26日', '1月27日', '1月28日', '1月29日', '1月30日',
  '2月2日', '2月8日', '2月9日', '2月15日', '2月16日', '2月22日', '2月23日', '2月29日',
  '3月1日', '3月7日', '3月8日', '3月14日', '3月15日', '3月21日', '3月22日', '3月28日', '3月29日',
  '4月4日', '4月5日', '4月6日', '4月11日', '4月12日', '4月18日', '4月19日', '4月25日',
  '5月1日', '5月2日', '5月3日', '5月4日', '5月5日', '5月10日', '5月16日', '5月17日', '5月23日', '5月24日', '5月30日', '5月31日',
  '6月6日', '6月7日', '6月13日', '6月14日', '6月20日', '6月21日', '6月25日', '6月26日', '6月27日',
  '7月4日', '7月5日', '7月11日', '7月12日', '7月18日', '7月19日', '7月25日', '7月26日',
  '8月1日', '8月2日', '8月8日', '8月9日', '8月15日', '8月16日', '8月22日', '8月23日', '8月29日', '8月30日',
  '9月5日', '9月6日', '9月12日', '9月13日', '9月19日', '9月20日', '9月26日',
  '10月1日', '10月2日', '10月3日', '10月4日', '10月5日', '10月6日', '10月7日', '10月8日', '10月11日', '10月17日', '10月18日', '10月24日', '10月25日', '10月31日',
  '11月1日', '11月7日', '11月8日', '11月14日', '11月15日', '11月21日', '11月22日', '11月28日', '11月29日',
  '12月1日', '12月7日', '12月8日', '12月15日', '12月14日', '12月22日', '12月21日', '12月28日', '12月29日', '1月1日'
]

const qianchuholiday = [
  '1月4日', '1月5日', '1月11日', '1月12日', '1月18日', '1月24日', '1月25日', '1月26日', '1月27日', '1月28日', '1月29日', '1月30日',
  '2月2日', '2月8日', '2月9日', '2月15日', '2月16日', '2月22日', '2月23日', '2月29日',
  '3月1日', '3月7日', '3月8日', '3月14日', '3月15日', '3月21日', '3月22日', '3月28日', '3月29日',
  '4月4日', '4月5日', '4月6日', '4月11日', '4月12日', '4月18日', '4月19日', '4月25日',
  '5月1日', '5月2日', '5月3日', '5月4日', '5月5日', '5月10日', '5月16日', '5月17日', '5月23日', '5月24日', '5月30日', '5月31日',
  '6月6日', '6月7日', '6月13日', '6月14日', '6月20日', '6月21日', '6月25日', '6月26日', '6月27日',
  '7月4日', '7月5日', '7月11日', '7月12日', '7月18日', '7月19日', '7月25日', '7月26日',
  '8月1日', '8月2日', '8月8日', '8月9日', '8月15日', '8月16日', '8月22日', '8月23日', '8月29日', '8月30日',
  '9月5日', '9月6日', '9月12日', '9月13日', '9月19日', '9月20日', '9月26日',
  '10月1日', '10月2日', '10月3日', '10月4日', '10月5日', '10月6日', '10月7日', '10月8日', '10月11日', '10月17日', '10月18日', '10月24日', '10月25日', '10月31日',
  '11月1日', '11月7日', '11月8日', '11月14日', '11月15日', '11月21日', '11月22日', '11月28日', '11月29日',
  '12月1日', '12月7日', '12月8日', '12月15日', '12月14日', '12月22日', '12月21日', '12月28日', '12月29日', '1月1日'
]

export function getSchedulDateGuohu () {
  let d = new Date()
  let year = d.getFullYear()
  let m = d.getMonth() + 1
  let date = d.getDate()
  let i = 0
  let result = []
  let flag = false
  while (i < 7) {
    if (!flag) {
      date = date + 1
    } else {
      flag = !flag
    }

    if (year % 4 === 0 && m === 2) {
      m = m + Math.floor((date / 29))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 1) { date = 2 }
      if (date === 29) {
        date = 1
        flag = true
      }
    } else if (year % 4 !== 0 && m === 2) {
      m = m + Math.floor((date / 29))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 1) { date = 2 }
      if (date === 29) {
        date = 1
        flag = true
      }
    } else if (m === 4 || m === 6 || m === 9 || m === 11) {
      if (date === 1) { date = 2 }
      m = m + Math.floor((date / 31))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 31) {
        date = 1
        flag = true
      }
    } else {
      // 12月 1月
      if (date === 1) { date = 2 }
      m = m + Math.floor((date / 32))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 32) {
        date = 1
        flag = true
      }
    }

    let dateStr = m + '月' + date + '日'
    if (holiday.indexOf(dateStr) === -1) {
      var tem = {
        date: dateStr,
        fullDate: year + '年' + dateStr
      }
      result.push(tem)
      i++
    }
  }
  console.log(result)
  return result
}

export function getSchedulDateQianchu () {
  let d = new Date()
  let year = d.getFullYear()
  let m = d.getMonth() + 1
  let date = d.getDate()
  let i = 0
  let result = []
  let flag = false

  while (i < 9) {
    if (!flag) {
      date = date + 1
    } else {
      flag = !flag
    }

    if (year % 4 === 0 && m === 2) {
      m = m + Math.floor((date / 29))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 1) { date = 2 }
      if (date === 29) {
        date = 1
        flag = true
      }
    } else if (year % 4 !== 0 && m === 2) {
      m = m + Math.floor((date / 29))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 1) { date = 2 }
      if (date === 29) {
        date = 1
        flag = true
      }
    } else if (m === 4 || m === 6 || m === 9 || m === 11) {
      if (date === 1) { date = 2 }
      m = m + Math.floor((date / 31))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 31) {
        date = 1
        flag = true
      }
    } else {
      if (date === 1) { date = 2 }
      m = m + Math.floor((date / 32))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 32) {
        date = 1
        flag = true
      }
    }

    let dateStr = m + '月' + date + '日'
    if (qianchuholiday.indexOf(dateStr) === -1) {
      var tem = {
        date: dateStr,
        fullDate: year + '年' + dateStr
      }
      if (i > 1) result.push(tem)
      i++
    }
  }
  console.log(result)
  return result
}
