const holiday = [
  '1月2日', '1月3日', '1月9日', '1月10日', '1月16日', '1月17日','1月23日', '1月24日', '1月30日', '1月31日',
  '2月6日', '2月11日', '2月12日', '2月13日', '2月14日', '2月15日', '2月16日', '2月17日', '2月21日', '2月27日', '2月28日',
  '3月6日', '3月7日', '3月13日', '3月14日', '3月20日', '3月21日', '3月27日', '3月28日',
  '4月3日', '4月4日', '4月5日', '4月10日', '4月11日', '4月17日', '4月18日', '4月24日',
  '5月1日', '5月2日', '5月3日', '5月4日', '5月5日', '5月9日', '5月15日', '5月16日', '5月22日', '5月23日', '5月29日', '5月30日',
  '6月5日', '6月6日', '6月12日', '6月13日', '6月14日', '6月19日', '6月20日', '6月26日', '6月27日',
  '7月3日', '7月4日', '7月10日', '7月11日', '7月17日', '7月18日', '7月24日', '7月25日', '7月31日',
  '8月1日', '8月7日', '8月8日', '8月14日', '8月15日', '8月21日', '8月22日', '8月28日', '8月29日',
  '9月4日', '9月5日', '9月11日', '9月12日', '9月19日', '9月20日', '9月21日', '9月25日',
  '10月1日', '10月2日', '10月3日', '10月4日', '10月5日', '10月6日', '10月7日', '10月10日', '10月16日', '10月17日', '10月23日', '10月24日', '10月30日', '10月31日',
  '11月6日', '11月7日', '11月13日', '11月14日', '11月20日', '11月21日', '11月27日', '11月28日',
  '12月5日', '12月6日', '12月12日', '12月13日', '12月19日', '12月20日', '12月26日', '12月27日', '1月1日'
]

const qianchuholiday = [
  '1月2日', '1月3日', '1月9日', '1月10日', '1月16日', '1月17日','1月23日', '1月24日', '1月30日', '1月31日',
  '2月6日', '2月11日', '2月12日', '2月13日', '2月14日', '2月15日', '2月16日', '2月17日', '2月21日', '2月27日', '2月28日',
  '3月6日', '3月7日', '3月13日', '3月14日', '3月20日', '3月21日', '3月27日', '3月28日',
  '4月3日', '4月4日', '4月5日', '4月10日', '4月11日', '4月17日', '4月18日', '4月24日',
  '5月1日', '5月2日', '5月3日', '5月4日', '5月5日', '5月9日', '5月15日', '5月16日', '5月22日', '5月23日', '5月29日', '5月30日',
  '6月5日', '6月6日', '6月12日', '6月13日', '6月14日', '6月19日', '6月20日', '6月26日', '6月27日',
  '7月3日', '7月4日', '7月10日', '7月11日', '7月17日', '7月18日', '7月24日', '7月25日', '7月31日',
  '8月1日', '8月7日', '8月8日', '8月14日', '8月15日', '8月21日', '8月22日', '8月28日', '8月29日',
  '9月4日', '9月5日', '9月11日', '9月12日', '9月19日', '9月20日', '9月21日', '9月25日',
  '10月1日', '10月2日', '10月3日', '10月4日', '10月5日', '10月6日', '10月7日', '10月10日', '10月16日', '10月17日', '10月23日', '10月24日', '10月30日', '10月31日',
  '11月6日', '11月7日', '11月13日', '11月14日', '11月20日', '11月21日', '11月27日', '11月28日',
  '12月5日', '12月6日', '12月12日', '12月13日', '12月19日', '12月20日', '12月26日', '12月27日', '1月1日'
]

export function getSchedulDateGuohu() {
  let d = new Date()
  let year = d.getFullYear()
  let m = d.getMonth() + 1
  let date = d.getDate()
  let i = 0
  let result = []
  let flag = false
  while (i < 7) {
    if (!flag) {
      date = date + 1
    } else {
      flag = !flag
    }
    if (year % 4 === 0 && m === 2) {
      m = m + Math.floor((date / 29))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 1) { date = 2 }
      if (date >= 29) {
        date = 1
        flag = true
      }
    } else if (year % 4 !== 0 && m === 2) {
      m = m + Math.floor((date / 29))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 1) { date = 2 }
      if (date === 29) {
        date = 1
        flag = true
      }
    } else if (m === 4 || m === 6 || m === 9 || m === 11) {
      if (date === 1) { date = 2 }
      m = m + Math.floor((date / 31))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 31) {
        date = 1
        flag = true
      }
    } else {
      // 12月 1月
      if (date === 1) { date = 2 }
      m = m + Math.floor((date / 32))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 32) {
        date = 1
        flag = true
      }
    }

    let dateStr = m + '月' + date + '日'
    if (holiday.indexOf(dateStr) === -1) {
      var tem = {
        date: dateStr,
        fullDate: year + '年' + dateStr
      }
      result.push(tem)
      i++
    }
  }
  console.log(result)
  return result
}

export function getSchedulDateQianchu() {
  let d = new Date()
  let year = d.getFullYear()
  let m = d.getMonth() + 1
  let date = d.getDate()
  let i = 0
  let result = []
  let flag = false

  while (i < 9) {
    if (!flag) {
      date = date + 1
    } else {
      flag = !flag
    }

    if (year % 4 === 0 && m === 2) {
      m = m + Math.floor((date / 29))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 1) { date = 2 }
      if (date >= 29) {
        date = 1
        flag = true
      }
    } else if (year % 4 !== 0 && m === 2) {
      m = m + Math.floor((date / 29))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 1) { date = 2 }
      if (date === 29) {
        date = 1
        flag = true
      }
    } else if (m === 4 || m === 6 || m === 9 || m === 11) {
      if (date === 1) { date = 2 }
      m = m + Math.floor((date / 31))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 31) {
        date = 1
        flag = true
      }
    } else {
      if (date === 1) { date = 2 }
      m = m + Math.floor((date / 32))
      if (m >= 13) { m = 1; year += 1 }
      if (date === 32) {
        date = 1
        flag = true
      }
    }

    let dateStr = m + '月' + date + '日'
    if (qianchuholiday.indexOf(dateStr) === -1) {
      var tem = {
        date: dateStr,
        fullDate: year + '年' + dateStr
      }
      if (i > 1) result.push(tem)
      i++
    }
  }
  console.log(result)
  return result
}
